import type { Slide } from "@/types/lesson";

export const lessonData: Slide[] = [
  {
    id: 1,
    title: "Командировка",
    type: "task",
    content: {
      title: "A. Командировка",
      description:
        "Каждый работник Петя уехал в командировку на целый год, представив исчерпывающий маршрут для своих коллег.",
      sections: [
        {
          title: "Ограничения",
          content: "Время выполнения: 1 сек\nПамять: 256 МБ",
        },
        {
          title: "Условие",
          content:
            "Каждый работник Петя уехал в командировку на целый год, представив исчерпывающий маршрут для своих коллег. Петя обязывался немедленно. Он торгует на кроватях и Ярослав подсказывает местные данные например: годы...",
        },
      ],
      inputData:
        "Первая строка содержит одно целое число n (1 ≤ n ≤ 100). В следующей строке записаны десятичные числа через пробел, разделенные пробелами: r-ое (1 ≤ r ≤ 12), число в строке обозначает от 0.1 до 100.",
      outputData:
        "Выведите единственное целое число — максимальное количество месяцев, в которые Петя будет покупать цветы, так чтобы цветы всегда не менее чем в k симметричных.",
      examples: [
        {
          input: "3\n4 2\n1 3 5 2",
          output: "2",
        },
        {
          input: "4\n6 12 5 2 8 7",
          output: "12 8",
        },
      ],
    },
  },
  {
    id: 2,
    title: "Переупорядочивание массива",
    type: "task",
    content: {
      title: "Переупорядочивание массива",
      description:
        "Дан массив целых чисел. Необходимо переупорядочить элементы массива.",
      inputData:
        "Первая строка содержит число n - количество элементов массива.",
      outputData: "Выведите переупорядоченный массив.",
      examples: [
        {
          input: "5\n1 3 2 5 4",
          output: "1 2 3 4 5",
        },
      ],
    },
  },
  {
    id: 3,
    title: "Переупорядочивание массива",
    type: "task",
    content: {
      title: "Переупорядочивание массива",
      description:
        "Дан массив целых чисел. Необходимо переупорядочить элементы массива.",
      examples: [],
    },
  },
  {
    id: 4,
    title: "Переупорядочивание массива",
    type: "task",
    content: {
      title: "Переупорядочивание массива",
      description:
        "Дан массив целых чисел. Необходимо переупорядочить элементы массива.",
      examples: [],
    },
  },

  {
    id: 5,
    title: "Переупорядочивание массива",
    type: "video",
    content: {
      title: "Переупорядочивание массива",
      description: "Видеоурок по переупорядочиванию массива.",
      videoUrl: "https://www.youtube.com/watch?v=eitbNPZpXO0",
    },
  },
  {
    id: 6,
    title: "Переупорядочивание массива",
    type: "video",
    content: {
      title: "Переупорядочивание массива",
      description: "Видеоурок по переупорядочиванию массива.",
      videoUrl: "https://www.youtube.com/watch?v=eitbNPZpXO0",
    },
  },
  {
    id: 7,
    title: "Круги Эйлера",
    type: "theory",
    content: {
      title: "Круги Эйлера",
      sections: [
        {
          title: "Презентация",
          content:
            "Круги Эйлера – это геометрическая схема, которая помогает находить и/или делать более наглядными логические связи между явлениями и понятиями. А также помогает изобразить отношения между каким-либо множеством и его частью. Круги Эйлера – это геометрическая схема, которая помогает находить и/или делать более наглядными логические связи между явлениями и понятиями. А также помогает изобразить отношения между каким-либо множеством и его частью\n\nКруги Эйлера – это геометрическая схема, которая помогает находить и/или делать более наглядными логические связи между явлениями и понятиями. А также помогает изобразить отношения между каким-либо множеством и его частью\n\nКруги Эйлера – это геометрическая схема, которая помогает находить и/или делать более наглядными логические связи между явлениями и понятиями. А также помогает изобразить отношения между каким-либо множеством и его частью\nКруги Эйлера – это геометрическая схема, которая помогает находить и/или делать более наглядными логические связи между явлениями и понятиями. А также помогает изобразить отношения между каким-либо множеством и его частью.\n\nКруги Эйлера – это геометрическая схема, которая помогает находить и/или делать более наглядными логические связи между явлениями и понятиями. А также помогает изобразить отношения между каким-либо множеством и его частью\nКруги Эйлера – это геометрическая схема, которая помогает находить и/или делать более наглядными логические связи между явлениями и понятиями. А также помогает изобразить отношения между каким-либо множеством и его частью.\nКруги Эйлера – это геометрическая схема, которая помогает находить и/или делать более наглядными логические связи между явлениями и понятиями. А также помогает изобразить отношения между каким-либо множеством и его частью\nКруги Эйлера – это геометрическая схема, которая помогает находить и/или делать более наглядными логические связи между явлениями и понятиями. А также помогает изобразить отношения между каким-либо множеством и его частью.\n\nКруги Эйлера – это геометрическая схема, которая помогает находить и/или делать более наглядными логические связи между явлениями и понятиями. А также помогает изобразить отношения между каким-либо множеством и его частью\n",
        },
        {
          title: "Аксиомы",
          content:
            "Круги Эйлера – это геометрическая схема, которая помогает находить и/или делать более наглядными логические связи между явлениями и понятиями. А также помогает изобразить отношения между каким-либо множеством и его частью. Круги Эйлера – это геометрическая схема, которая помогает находить и/или делать более наглядными логические связи между явлениями и понятиями. А также помогает изобразить отношения между каким-либо множеством и его частью\n\nКруги Эйлера – это геометрическая схема, которая помогает находить и/или делать более наглядными логические связи между явлениями и понятиями. А также помогает изобразить отношения между каким-либо множеством и его частью\n\nКруги Эйлера – это геометрическая схема, которая помогает находить и/или делать более наглядными логические связи между явлениями и понятиями. А также помогает изобразить отношения между каким-либо множеством и его частью\nКруги Эйлера – это геометрическая схема, которая помогает находить и/или делать более наглядными логические связи между явлениями и понятиями. А также помогает изобразить отношения между каким-либо множеством и его частью.\n\nКруги Эйлера – это геометрическая схема, которая помогает находить и/или делать более наглядными логические связи между явлениями и понятиями. А также помогает изобразить отношения между каким-либо множеством и его частью\nКруги Эйлера – это геометрическая схема, которая помогает находить и/или делать более наглядными логические связи между явлениями и понятиями. А также помогает изобразить отношения между каким-либо множеством и его частью.\nКруги Эйлера – это геометрическая схема, которая помогает находить и/или делать более наглядными логические связи между явлениями и понятиями. А также помогает изобразить отношения между каким-либо множеством и его частью\nКруги Эйлера – это геометрическая схема, которая помогает находить и/или делать более наглядными логические связи между явлениями и понятиями. А также помогает изобразить отношения между каким-либо множеством и его частью.\n\nКруги Эйлера – это геометрическая схема, которая помогает находить и/или делать более наглядными логические связи между явлениями и понятиями. А также помогает изобразить отношения между каким-либо множеством и его частью\n",
        },
      ],
    },
  },
];
